perf/results/clickhouse/write_200rps.txt
Running 30s test @ http://localhost:9411
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.914ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.893ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.831ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.849ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.84ms    1.31ms  17.55ms   95.16%
    Req/Sec    54.97     95.51   500.00     78.51%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.64ms
 75.000%    2.11ms
 90.000%    2.60ms
 99.000%    8.88ms
 99.900%   14.89ms
 99.990%   17.57ms
 99.999%   17.57ms
100.000%   17.57ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.245     0.000000            1         1.00
       0.920     0.100000          399         1.11
       1.142     0.200000          797         1.25
       1.333     0.300000         1197         1.43
       1.479     0.400000         1595         1.67
       1.635     0.500000         1993         2.00
       1.710     0.550000         2196         2.22
       1.793     0.600000         2392         2.50
       1.885     0.650000         2591         2.86
       1.996     0.700000         2789         3.33
       2.109     0.750000         2990         4.00
       2.167     0.775000         3091         4.44
       2.235     0.800000         3191         5.00
       2.309     0.825000         3290         5.71
       2.399     0.850000         3388         6.67
       2.483     0.875000         3486         8.00
       2.551     0.887500         3536         8.89
       2.605     0.900000         3587        10.00
       2.689     0.912500         3638        11.43
       2.773     0.925000         3686        13.33
       2.893     0.937500         3735        16.00
       2.965     0.943750         3760        17.78
       3.019     0.950000         3786        20.00
       3.111     0.956250         3810        22.86
       3.233     0.962500         3835        26.67
       3.435     0.968750         3860        32.00
       3.615     0.971875         3873        35.56
       3.981     0.975000         3885        40.00
       4.587     0.978125         3897        45.71
       5.343     0.981250         3910        53.33
       5.959     0.984375         3922        64.00
       6.371     0.985938         3928        71.11
       7.367     0.987500         3935        80.00
       8.083     0.989062         3941        91.43
       9.151     0.990625         3947       106.67
       9.863     0.992188         3953       128.00
      10.103     0.992969         3956       142.22
      10.559     0.993750         3960       160.00
      10.695     0.994531         3963       182.86
      11.263     0.995313         3966       213.33
      11.639     0.996094         3969       256.00
      12.175     0.996484         3970       284.44
      13.159     0.996875         3972       320.00
      13.319     0.997266         3974       365.71
      13.999     0.997656         3975       426.67
      14.735     0.998047         3977       512.00
      14.735     0.998242         3977       568.89
      14.759     0.998437         3978       640.00
      14.799     0.998633         3979       731.43
      14.887     0.998828         3980       853.33
      15.047     0.999023         3981      1024.00
      15.047     0.999121         3981      1137.78
      15.047     0.999219         3981      1280.00
      17.183     0.999316         3982      1462.86
      17.183     0.999414         3982      1706.67
      17.391     0.999512         3983      2048.00
      17.391     0.999561         3983      2275.56
      17.391     0.999609         3983      2560.00
      17.391     0.999658         3983      2925.71
      17.391     0.999707         3983      3413.33
      17.567     0.999756         3984      4096.00
      17.567     1.000000         3984          inf
#[Mean    =        1.836, StdDeviation   =        1.312]
#[Max     =       17.552, Total count    =         3984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6004 requests in 30.00s, 615.64KB read
Requests/sec:    200.11
Transfer/sec:     20.52KB